/** @file Acq.h*/


#ifndef _ACQUISITION_H
#define _ACQUISITION_H

//////////////////////////////////////////////////////
// IMPORTANT:
// When implementing the XISL dll into a .net environment some datatypes might have to be changed to to size definition:
//
// e.g. 
// XISL dll: long has 4 byte
// .net: int has 4 byte, long has 8 byte
// so long has to be important as int
// 
// XISL dll: char has 1 byte
// .net: char has 2 bytes
//
//////////////////////////////////////////////////////

#define DATASHORT               2 //2 byte integer
#define DATALONG                4 //4 byte integer
#define DATAFLOAT               8 //8 byte double
#define DATASIGNED              16 // signed

#ifdef __cplusplus
extern "C" {
#endif  /* __cplusplus */

#define __NOASM

//#define __X64 // Define this for the 64bit Driver Version
#ifdef _WIN64
#   ifndef __X64
#       define __X64
#   endif
#endif

#if defined(__X64)
#	ifndef XIS_OS_64
#		define XIS_OS_64
#	endif
#endif

#ifdef _WIN32
#include <Windows.h>
#endif

#ifdef __linux__   
	#include "windefines.h"
	#include "DataType.h"
#endif


#ifdef XIS_OS_64	// MERGE: think about these macros
    /**
    * @ingroup enum
    */
	typedef void* ACQDESCPOS;
#else
    /**
    * @ingroup enum
    */
	typedef UINT ACQDESCPOS;
#endif


/** 
* AcquisitionDesc defines a data structure that is 
* used by all functions of XISL. It contains all 
* required parameters for the acquisition.
* Access to the data fields is only possible via 
* the XISL API functions. HACQDESC defines a HANLDE to the acquisition descriptor.
* @see AcquisitionDesc
* @ingroup enum
**/
typedef HANDLE HACQDESC;
#ifdef __linux__
    /**
    * @ingroup enum
    */
    typedef unsigned int DEX_RETURN;
#else
	// Windows
	#ifndef USE_XISL_AS_STATIC_LIB
    #ifdef _DLL_EXPORT
		#define _DLL_API __declspec(dllexport) 
    #else
		#define _DLL_API __declspec(dllimport) 
    #endif //_ACQDEFS_H
	#else
		#define _DLL_API 
	#endif // USE_XISL_AS_STATIC_LIB

    #define HIS_RETURN _DLL_API UINT WINAPI
	#define DEX_RETURN _DLL_API UINT WINAPI
    
#endif


#define _GBIF_1313


#define WINRESTSIZE					34
#define WINHARDWAREHEADERSIZE		32
#define WINRESTSIZE101				32
#define WINHARDWAREHEADERSIZEID15	2048
#define DETEKTOR_DATATYPE_18BIT 16
#define MAX_GREY_VALUE_18BIT  262144

#ifndef __GBIF_Types
#define __GBIF_Types
	#define GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH		16
	#define GBIF_STRING_DATATYPE unsigned char
	#define GBIF_STRING_DATATYPE_ELTEC char
#endif


typedef struct
{	
	GBIF_STRING_DATATYPE	ucMacAddress[GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH];			// unsigned since the adress components can be higher than 128
	GBIF_STRING_DATATYPE	ucIP[GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH];
	GBIF_STRING_DATATYPE	ucSubnetMask[GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH];
	GBIF_STRING_DATATYPE	ucGateway[GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH];
	GBIF_STRING_DATATYPE	ucAdapterIP[GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH];
	GBIF_STRING_DATATYPE	ucAdapterMask[GBIF_IP_MAC_NAME_CHAR_ARRAY_LENGTH];

	DWORD					dwIPCurrentBootOptions;
	CHAR 					cManufacturerName[32];
	CHAR					cModelName[32];												// GBIF
	CHAR					cGBIFFirmwareVersion[32];
	CHAR					cDeviceName[16];

} GBIF_DEVICE_PARAM;

// 128Byte in total
typedef struct
{	
	char	cDetectorType[32];															// e.g. XRD 0822 AO 14
	char	cManufacturingDate[8];														// e.g. 201012
	char	cPlaceOfManufacture[8];														// e.g. DE
    char    cUniqueDeviceIdentifier[16];
    char    cDeviceIdentifier[16];
	char	cDummy[48];
} GBIF_Detector_Properties;

#define HIS_GbIF_FIRST_CAM 0
#define HIS_GbIF_IP 1
#define HIS_GbIF_MAC 2
#define HIS_GbIF_NAME 3

#define HIS_GbIF_IP_STATIC	1
#define HIS_GbIF_IP_DHCP	2
#define HIS_GbIF_IP_LLA		4

//*/

typedef struct
{
	DWORD	dwPROMID;
	DWORD	dwHeaderID;
	BOOL	bAddRow;
	BOOL	bPwrSave;
	DWORD	dwNrRows;
	DWORD	dwNrColumns;
	DWORD	dwZoomULRow;
	DWORD	dwZoomULColumn;
	DWORD	dwZoomBRRow;
	DWORD	dwZoomBRColumn;
	DWORD	dwFrmNrRows;
	DWORD	dwFrmRowType;
	DWORD	dwFrmFillRowIntervalls;
	DWORD	dwNrOfFillingRows;
	DWORD	dwDataType;
	DWORD	dwDataSorting;
	DWORD	dwTiming;
	DWORD	dwAcqMode;
	DWORD	dwGain;
	DWORD	dwOffset;
	DWORD	dwAccess;
	BOOL	bSyncMode;
	DWORD	dwBias;
	DWORD	dwLeakRows;
} CHwHeaderInfo;

typedef struct
{
	WORD	wHeaderID;		// 0
	WORD	wPROMID;		// 1
	WORD	wResolutionX;	// 2
	WORD	wResolutionY;	// 3
	WORD	wNrRows;		// 4
	WORD	wNrColumns;		// 5
	WORD	wZoomULRow;		// 6
	WORD	wZoomULColumn;	// 7
	WORD	wZoomBRRow;		// 8
	WORD	wZoomBRColumn;	// 9
	WORD	wFrmNrRows;		// A
	WORD	wFrmRowType;	// B
	WORD	wRowTime;		// C << 6
	WORD	wClock;			// D << 6
	WORD	wDataSorting;	// E
	WORD	wTiming;		// F
	WORD	wGain;			// 10
	WORD	wLeakRows;		// 11
	WORD	wAccess;		// 12
	WORD	wBias;			// 13
	WORD	wUgComp;		// 14
	WORD	wCameratype;	// 15
	WORD	wFrameCnt;		// 16
	WORD	wBinningMode;	// 17
	WORD	wRealInttime_milliSec;	// 18 
	WORD	wRealInttime_microSec;	// 19
	WORD	wStatus;		// 1A
	WORD	wCommand1;		// 1B
	WORD	wCommand2;		// 1C
	WORD	wCommand3;		// 1D
	WORD	wCommand4;		// 1E
	WORD	wDummy;			// 1F
}	CHwHeaderInfoEx;

#pragma pack(push, 1)
typedef struct
{
	WORD FileType;			//!<  File ID (0x7000)
	WORD HeaderSize;		//!<  Size of this file header in Bytes
	WORD HeaderVersion;		//!<  Must be 100, default XIS file header not to be used for onboard 
    UINT FileSize;			//!<  Size of the whole file in Bytes ( HeaderSize+ImageHeaderSize+Frames*rows*columns*datatypesize )
	WORD ImageHeaderSize;	//!<  Size of the Image header in Bytes 32 Bytes, values can be all zero
	WORD ULX, ULY, BRX, BRY;//!<  Bounding rectangle of the image
	WORD NrOfFrames;		//!<  Nr of Frames in seq
	WORD Correction;		//!<  0 = none, 1 = offset, 2 = gain, 4 = bad pixel, (ored) can be 0
	double IntegrationTime;	//!<  Frame time in microseconds can by 0
	WORD TypeOfNumbers;		//!<  Refer to enum XIS_FileType
	BYTE x[WINRESTSIZE];	//!<  Fill up this struct to have a size of 68 bytes (FileHeaderSize)
} WinHeaderType;




typedef struct 
{
